app/controllers/api/v1/categories_controller.rb

    def index
        respond_with Category.all
---
SELECT "categories".* FROM "categories"